Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Before we build and deploy our application we need to log into an OpenShift cluster. You can log in via the https://docs.openshift.com/container-platform/4.9/cli_reference/openshift_cli/getting-started-cli.html[OpenShift CLI]:
ja_jp: アプリケーションをビルドしてデプロイする前に、OpenShift クラスターにログインする必要があります。ログインは、 https://docs.openshift.com/container-platform/4.9/cli_reference/openshift_cli/getting-started-cli.html[OpenShift CLI] から行うことができます。

source: Before we implement the REST endpoint and data management code, we must set up the database schema. It would also be convenient to have some data inserted up front.
ja_jp: REST エンドポイントとデータ管理コードを実装する前に、データベーススキーマを設定する必要があります。 事前に何らかのデータを挿入しておくと便利です。

source: Before we implement the REST endpoint and data management code, we need to set up the database schema. It would also be convenient to have some data inserted up-front.
ja_jp: REST エンドポイントとデータ管理コードを実装する前にデータベーススキーマを設定する必要があります。また、いくつかのデータを前もって挿入しておくと便利です。

source: Before we implement the REST endpoint and data management code, we need to setup the database schema. It would also be convenient to have some data inserted up-front.
ja_jp: REST エンドポイントとデータ管理コードを実装する前に、データベーススキーマを設定する必要があります。また、いくつかのデータを前もって挿入しておくと便利です。

source: Before we test the logout, make sure the `Auth0` application is configured to allow this post logout redirect back to Quarkus after the user has been logged out:
ja_jp: ログアウトをテストする前に、ユーザーがログアウトした後の Quarkus へのリダイレクトを許可するように、 `Auth0` アプリケーションが設定されていることを確認します。

source: Before you choose an authentication mechanism for securing your Quarkus applications, review the information provided.
ja_jp: Quarkus アプリケーションを保護するための認証メカニズムを選択する前に、提供される情報を確認してください。

source: Before you request a Let's Encrypt certificate:
ja_jp: Let's Encrypt 証明書をリクエストする前に、以下を実行します。

source: Before you start Quarkus on the remote host set the environment variable `QUARKUS_LAUNCH_DEVMODE=true`. If you are on bare metal you can set it via the `export QUARKUS_LAUNCH_DEVMODE=true` command and then run the application with the proper `java -jar ...` command to run the application.
ja_jp: リモートホストでQuarkusを起動する前に、環境変数 `QUARKUS_LAUNCH_DEVMODE=true` を設定します。ベアメタルを使用している場合は、 `export QUARKUS_LAUNCH_DEVMODE=true` コマンドで設定し、適切に `java -jar ...` コマンドでアプリケーションを実行します。

source: Before you start building security into your Quarkus applications, review the overview information to learn about the Quarkus Security architecture and the different authentication and authorization mechanisms that Quarkus supports.
ja_jp: Quarkusアプリケーションにセキュリティを組み込む前に、概要情報を確認し、Quarkusのセキュリティアーキテクチャと、Quarkusがサポートするさまざまな認証および認可メカニズムについて学んでください。

source: Before you submit a pull request, preview the HTML output of your AsciiDoc source by using one of the following build methods:
ja_jp: Pull Request を送信する前に、以下のビルド方法のいずれかを使用して、AsciiDoc ソースの HTML 出力をプレビューしてください:

source: Before:
ja_jp: 変更前:

source: Begin a Hibernate Reactive transaction.
ja_jp: Hibernate Reactive トランザクションを開始します。

source: Begin a Kafka transaction.
ja_jp: Kafka トランザクションを開始します。

source: Behavior can still be overridden on a class or method level by annotating them directly, however, all endpoints without an annotation will now follow the default, no matter their method signature.
ja_jp: クラスやメソッドに直接アノテーションを付けることで動作をオーバーライドすることは可能ですが、アノテーションのないエンドポイントは、メソッドのシグネチャに関係なくデフォルトに従うようになりました。

source: Behaviour can still be overridden on a class or method level by annotating them directly, however all endpoints without an annotation will now follow the default, no matter their method signature.
ja_jp: 動作は、クラスまたはメソッドレベルで直接アノテーションを付けることでオーバーライドできますが、アノテーションのないすべてのエンドポイントは、メソッドのシグネチャーに関係なく、デフォルトに従うようになります。

source: Being _deprecated_ means that this extension is likely to be replaced or removed in a future version of Quarkus.
ja_jp: _deprecated_ は、このエクステンションが Quarkus の将来のバージョンで置き換えられるか削除される可能性が高いことを意味します。

source: Being _stable_, backward compatibility and presence in the ecosystem are taken very seriously.
ja_jp: _安定性_ 、後方互換性、エコシステムにおける存在感は非常に重要視されています。

source: Being open to improvements (e.g. on configuration).
ja_jp: 設定などの改善に前向きであること。

source: Being reactive
ja_jp: リアクティブであること

source: Below are examples of various options that can be configured following this approach.
ja_jp: 以下に、このアプローチに従って設定できる様々なオプションの例を示します。

source: Below is a summary of the options.
ja_jp: 以下、選択肢の概要をご紹介します。

source: Below is a visual overview of the layout:
ja_jp: 以下はレイアウトの視覚的な概要です:

source: Below is an example of (required) additional configuration when using xDS gRPC with the Istio Service Mesh in Kubernetes.
ja_jp: 以下は、KubernetesのIstio Service MeshでxDS gRPCを使用する場合の（必須）追加設定例です。

source: Below is an example of a Quarkus Maven plugin configuration that will produce two builds of the same application: one using the `prod-oracle` profile and the other one using the `prod-postgresql` profile.
ja_jp: 以下は、同じアプリケーションの 2 つのビルド (1 つは `prod-oracle` プロファイルを使用し、もう 1 つは `prod-postgresql` プロファイルを使用) を生成する Quarkus Maven プラグイン設定の例です。

source: Below is an example of a Quarkus-supplied converter:
ja_jp: 以下は、Quarkus が提供するコンバーターの例です。

source: Below is an example of a mapping configurer that applies programmatic mapping:
ja_jp: 以下は、プログラムによるマッピングを適用するマッピング Configurer の例です。

source: Below is an example of a test that uses the `MockAuthorizationServerTestResource`.
ja_jp: 以下は、 `MockAuthorizationServerTestResource` を使用したテストの例です。

source: Below is the `FortuneRepository` except the blocking we've seen earlier has been replaced by reactive methods.
ja_jp: 以下はブロッキングがリアクティブメソッドに置き換えられているだけの、先ほど見た `FortuneRepository` です。

source: Below, you can see how the container images created above can be built and deployed to AWS using the `docker` and `aws` command line tools. These instructions work for both native and jvm container images and assume that the `aws` command line tool has been logged in.
ja_jp: 以下に、 `docker` および `aws` コマンドラインツールを使用して、上記で作成したコンテナイメージをビルドして AWS にデプロイする方法を示します。これらの手順は、ネイティブコンテナイメージと jvm コンテナイメージの両方で機能し、 `aws` コマンドラインツールがログインしていることを前提としています。

source: Benchmarks
ja_jp: ベンチマーク

source: Benefits of Quarkus for AI-Infused Applications
ja_jp: AI搭載アプリケーション向けQuarkusの利点

source: Bernhard Lutzmann, architect and backend software engineer on the Polaris project team, said it best: _“The learning curve for Quarkus was extremely short. Quarkus has a number of great resources including guides, blogs and a supportive community on Zulip.”_
ja_jp: Polarisプロジェクトチームのアーキテクト兼バックエンドソフトウェアエンジニアであるBernhard Lutzmann氏は、このように述べています。 _"Quarkusの学習曲線は極めて短いものでした。Quarkusには、ガイド、ブログ、Zulipのサポートコミュニティなど、数多くの素晴らしいリソースがあります。"_

source: Beside generating a `DeploymentConfig` resource, you can also choose to get either a `Deployment`, `StatefulSet`, or a `Job`, or a `CronJob` resource instead via `application.properties`:
ja_jp: `DeploymentConfig` リソースを生成する以外にも、 `Deployment` 、 `StatefulSet` 、 `Job` 、 `CronJob` リソースのいずれかを作成することも `application.properties` の設定で可能です。

source: Beside generating a `Deployment` resource, you can also choose to get a `StatefulSet` instead via `application.properties`:
ja_jp: `Deployment` リソースを生成する以外に、 `application.properties` を介して `StatefulSet` を取得することを選択することも可能です。

source: Beside generating a `Deployment` resource, you can also choose to get either a `DeploymentConfig`, `StatefulSet`, `Job`, or a `CronJob` resource instead by using `application.properties`:
ja_jp: `Deployment` リ ソ ース を生成す る だけでな く 、 `application.properties` を使って `DeploymentConfig` 、 `StatefulSet` 、 `Job` 、 `CronJob` リ ソ ース を取得す る こ と も で き ます：

source: Beside generating a `Deployment` resource, you can also choose to get either a `DeploymentConfig`, `StatefulSet`, `Job`, or a `CronJob` resource instead via `application.properties`:
ja_jp: `Deployment` リ ソ ース を生成す る だけでな く 、 `application.properties` で設定することで `DeploymentConfig` 、 `StatefulSet` 、 `Job` 、 `CronJob` リ ソ ース を取得す る こ と も で き ます：

source: Beside the challenges of running ad hoc libraries in GraalVM, there were a few unexpected behaviors or minor pain points we ran into, such as:
ja_jp: GraalVMでアドホック・ライブラリを動作させる上での課題以外にも、予期せぬ動作やちょっとした問題点がいくつかありました。

source: Beside work on the Vault, FreeMarker and OpenShift Client extensions, we started contributing a few PRs in and outside Quarkus, hoping to speed up the process of getting improvements, such as:
ja_jp: Vault、FreeMarker、OpenShift Clientのエクステンションの作業の他に、Quarkus内外でいくつかのPRに貢献し始めました。これは、以下のような改善を得るためのプロセスをスピードアップすることを期待しています。

source: Besides generating a `Deployment` resource, you can also choose to generate either a `StatefulSet`, or a `Job`, or a `CronJob` resource instead via `application.properties`:
ja_jp: `Deployment` リソースの他に、 `StatefulSet` 、 `Job` 、 `CronJob` リソースの代わりに `application.properties` を生成することもできます:

source: Besides the _LoggingCloudWatchConfig_ there is another parameter of the _addCloudwatchLogHandler()_ method. It’s the corresponding factory class.
ja_jp: _LoggingCloudWatchConfig_の他に、 _addCloudwatchLogHandler()_メソッドのパラメータがあります。それは対応するファクトリークラスです。

source: Besides the dependencies, that are an input to a build process, there is also an outcome of the build that is the final distribution of an application. Users of an application may request an SBOM manifesting not only the dependencies (the input to a build) but also the final distribution (the outcome of the build) before they agree to deploy the application. Quarkus allows application developers to choose various packaging types for their applications, some of which are Quarkus-specific. Providing certain Quarkus-specific details about components included in a distribution may help better evaluate the impact of potential security-related issues.
ja_jp: ビルドプロセスへの入力となる依存関係のほかに、アプリケーションの最終的なディストリビューションであるビルドの出力もあります。アプリケーションユーザーは、アプリケーションのデプロイに同意する前に、依存関係 (ビルドへの入力) だけでなく最終的なディストリビューション (ビルドの出力) も明示する SBOM をリクエストする場合があります。アプリケーション開発者は、Quarkus 固有のものも含むさまざまなパッケージタイプを Quarkus でアプリケーションに対して選択できます。ディストリビューションに含まれるコンポーネントに関する Quarkus 固有の詳細を提供することで、潜在的なセキュリティー関連問題の影響をより適切に評価できるようになります。

source: Besides the fact that it's practically always way more than necessary, it may actually cause a serious compatibility issue that could have been avoided if the Quarkus platform BOM was not trying to manage the "universe". For example, including a library that depends on a different version of the `commons-beanutils:commons-beanutils` than Camel Quarkus into an application that actually does not include any Camel Quarkus extension may become problematic, because the `io.quarkus:quarkus-universe-bom` will enforce the version required by Camel Quarkus.
ja_jp: 実質的に常に必要以上に多いという事実に加えて、QuarkusプラットフォームのBOMが"universe"を管理しようとしていなければ回避できたかもしれない深刻な互換性の問題を実際に引き起こす可能性があります。例えば、Camel Quarkusとは異なるバージョンの `commons-beanutils:commons-beanutils` に依存するライブラリを、実際にはCamel Quarkusのエクステンションを含まないアプリケーションに含めると、問題が発生する可能性があります。なぜなら、 `io.quarkus:quarkus-universe-bom` はCamel Quarkusが要求するバージョンを強制するからです。

source: Best of Breed Libraries and Standards
ja_jp: 各分野における最高のライブラリーと標準

source: Best of breed frameworks and standards:: when we explain our stack
ja_jp: Best of breed frameworks and standards:: スタックを説明するとき

source: Best regards, Bennet
ja_jp: よろしくお願いいたします、ベネット

source: Better default for Garbage Collection implementation
ja_jp: ガベージコレクション実装のためのより良いデフォルト値

source: Better infrastructure for JDBC driver extensions
ja_jp: JDBCドライバエクステンションのためのより良いインフラ

source: Between 3-12 words and 50-80 characters per line to optimize findability in search engines
ja_jp: 検索エンジンでの検索性を最適化するため、1 行あたり 3〜12 ワード、50〜80 文字程度とします

source: Beware of cardinality explosion.
ja_jp: カーディナリティーの急増 (cardinality explosion) に注意してください。

source: Beware of common Java API overrides
ja_jp: よくある Java API オーバーライドの注意点

source: Beware that native compilation can take a significant amount of time! Once the compilation is done, you can run the native executable as follows:
ja_jp: ネイティブコンパイルにはかなりの時間がかかる可能性があることに注意してください。コンパイルが完了したら、次のようにネイティブ実行可能ファイルを実行できます。

source: Beyond generating a Google Cloud Functions project that is covered in the xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide], there's also a quickstart for running Funqy HTTP on Google Cloud Functions.
ja_jp: link:gcp-functions-http.html[Google Cloud Functions HTTP Guide] で紹介されているGoogle Cloud Functionsプロジェクトの生成に加え、Google Cloud Functions上でFunqy HTTPを実行するためのクイックスタートも用意されています。

source: Beyond generating an AWS project that is covered in the xref:amazon-lambda-http.adoc[Amazon Lambda Http Guide], there's also a quickstart for running Funqy HTTP on AWS Lambda.
ja_jp: link:amazon-lambda-http.html[Amazon Lambda Http Guide] で説明されているAWSプロジェクトの生成以外にも、AWS LambdaでFunqy HTTPを実行するためのクイックスタートがあります。

source: Beyond generating an AWS project that is covered in the xref:aws-lambda-http.adoc[AWS Lambda Http Guide], there's also a quickstart for running Funqy HTTP on AWS Lambda.
ja_jp: xref:aws-lambda-http.adoc[AWS Lambda Http Guide] でカバーされているAWSプロジェクトの生成以外にも、AWS Lambda上でFunqy HTTPを実行するためのクイックスタートもあります。

source: Beyond simply working, we’re aiming for Joy.
ja_jp: 単に動作するだけでなく、満足を目指しています。

source: Beyond the core framework, Quarkus offers access to the **Quarkiverse**, an ecosystem of hundreds of community-driven and vendor-supported extensions. Rather than building custom integrations, the Polaris team leverages battle-tested extensions for persistence (PostgreSQL, MongoDB), security (OIDC, OPA), and observability (OpenTelemetry, Micrometer), as the next section illustrates with concrete examples from the codebase.
ja_jp: コアフレームワークを超えて、Quarkus は、数百ものコミュニティ主導およびベンダーサポートのエクステンションからなるエコシステムである **Quarkiverse** へのアクセスを提供します。Polaris チームは、カスタム統合を構築するのではなく、永続化 (PostgreSQL、MongoDB)、セキュリティ (OIDC、OPA)、および可観測性 (OpenTelemetry、Micrometer) のために実証済みエクステンションを活用しており、次のセクションでコードベースからの具体的な例とともに説明します。

source: Beyond these two options, `-XX:+PrintHeapShape` and `-XX:+TraceHeapChunks` provide even lower level details about memory chunks on top of which the different memory regions are constructed.
ja_jp: この2つのオプションの他に、 `-XX:+PrintHeapShape` と `-XX:+TraceHeapChunks` は、異なるメモリ領域を構築するためのメモリチャンクに関するさらに低いレベルの詳細を提供します。

source: Bi-directional communication with browsers using SockJS
ja_jp: SockJSによるブラウザとの双方向通信

source: Bidirectional communication with browsers by using SockJS
ja_jp: SockJSによるブラウザとの双方向通信

source: Bidirectional communication with browsers using SockJS
ja_jp: SockJSによるブラウザとの双方向通信

source: Big bang change from OpenTracing to OpenTelemetry
ja_jp: OpenTracing から OpenTelemetry へのビッグバン方式の変更

source: Bigger Community outreach and a great place to collaborate
ja_jp: より大きなコミュニティのアウトリーチと素晴らしいコラボレーションの場

source: Billed duration
ja_jp: 課金期間

source: Binary
ja_jp: バイナリ

source: Binary content, with `content_type` set to `application/octet-stream`
ja_jp: `content_type` が `application/octet-stream` に設定されたバイナリーコンテンツ

source: Binder pattern: An extension can opt to use completely different gathering implementations depending on the metrics system. An `Optional<MetricsCapabilityBuildItem> metricsCapability` build step parameter can be used to declare or otherwise initialize API-specific metrics based on the active metrics extension (e.g. "micrometer"). This pattern can be combined with the consumer pattern by using `MetricsFactory::metricsSystemSupported()` to test the active metrics extension within the recorder.
ja_jp: バインダーパターン: エクステンションは、メトリクスシステムに応じて完全に異なる収集実装を使用することを選択できます。 `Optional<MetricsCapabilityBuildItem> metricsCapability` ビルドステップパラメーターを使用して、アクティブなメトリクスエクステンション (例: "micrometer") に基づいて API 固有のメトリクスを宣言または初期化できます。このパターンは、レコーダー内で `MetricsFactory::metricsSystemSupported()` を使用してアクティブなメトリクスエクステンションをテストすることにより、コンシューマーパターンと組み合わせることができます。

source: Binder pattern: An extension can opt to use completely different gathering implementations depending on the metrics system. An `Optional<MetricsCapabilityBuildItem> metricsCapability` build step parameter can be used to declare or otherwise initialize API-specific metrics based on the active metrics extension (e.g. "smallrye-metrics" or "micrometer"). This pattern can be combined with the consumer pattern by using `MetricsFactory::metricsSystemSupported()` to test the active metrics extension within the recorder.
ja_jp: バインダーパターン: エクステンションは、メトリクスシステムに応じて完全に異なる収集実装の使用を選択できます。 `Optional<MetricsCapabilityBuildItem> metricsCapability` ビルドステップパラメーターを使用して、アクティブなメトリクスエクステンション (smallrye-metrics や micrometer など) に基づいて API 固有メトリクスを宣言または初期化できます。このパターンは、 `MetricsFactory::metricsSystemSupported()` を使用して、レコーダー内のアクティブなメトリクスエクステンションをテストすることにより、コンシューマーパターンと組み合わせることができます。

source: Binding Red Hat OpenShift managed services to Quarkus application using the Service Binding Operator
ja_jp: Service Binding Operator を使用した Red Hat OpenShift マネージドサービスの Quarkus アプリケーションへのバインド

source: Binding the Session to ThreadLocal context
ja_jp: セッションをThreadLocalコンテキストにバインドする

source: Blaze-Persistence configuration properties
ja_jp: Blaze-Persistenceの設定プロパティー

source: Blaze-Persistence currently does not come with support for Apache Derby. This limitation could be lifted in the future, if there's a compelling need for it and if someone contributes it.
ja_jp: Blaze-Persistenceは現在、Apache Derbyをサポートしていません。切実なニーズが存在し、誰かがコントリビュートしてくれれば、この制限は、将来的には解除されるかもしれません。

source: Blaze-Persistence offers a fluent query builder API on top of JPA with a deep Hibernate ORM integration that enables the use of advanced SQL features like Common Table Expressions while staying in the realm of the JPA model.
ja_jp: Blaze-Persistenceは、Hibernate ORMとの深い統合により、JPAの上に流れるようなクエリビルダAPIを提供し、JPAモデルの範囲内でありながら、共通テーブル式のような高度なSQL機能の使用を可能にします。

source: Blaze-Persistence offers a fluent query builder API on top of Jakarta Persistence with a deep Hibernate ORM integration that enables the use of advanced SQL features like Common Table Expressions while staying in the realm of the Jakarta Persistence model.
ja_jp: Blaze-Persistenceは、Jakarta Persistenceの上に流暢なクエリビルダAPIを提供し、Hibernate ORMとの深い統合により、Jakarta Persistenceモデルの領域に留まりながらCommon Table Expressionsなどの高度なSQL機能を使用することができます。

source: Blocking (non-reactive) and reactive configuration xref:orm-and-reactive-extension-simultaneously[can be mixed together in the same project].
ja_jp: ブロッキング (非リアクティブ) 設定とリアクティブ設定は xref:orm-and-reactive-extension-simultaneously[同じプロジェクト内で混在させることができます]。

source: Blocking Service Implementation
ja_jp: ブロッキングサービスの実装

source: Blocking Stub
ja_jp: ブロッキングスタブ

source: Blocking calls
ja_jp: ブロッキング呼出

source: Blocking methods must execute on a worker thread unless annotated with `@RunOnVirtualThread` or in a class annotated with `@RunOnVirtualThread`.
ja_jp: ブロッキングメソッドは、 `@RunOnVirtualThread` アノテーションが付けられている場合、または、 `@RunOnVirtualThread` アノテーションがクラスに付けられている場合を除き、 ワーカースレッド上で実行される必要があります。

source: Blocking processing
ja_jp: ブロッキング処理

source: Blocking processing of events
ja_jp: イベントのブロッキング処理

source: Blocking version
ja_jp: ブロッキング版

source: Blog
ja_jp: ブログ

source: Bloom filters
ja_jp: ブルームフィルタ

source: Body handler for the management router.
ja_jp: 管理ルーターのボディハンドラ。

source: Body handler.
ja_jp: ボディハンドラー

source: Books
ja_jp: 書籍

source: Boolean values will be `true` in cases "true", "1", "YES", "Y" "ON". Otherwise, value will be interpreted as false
ja_jp: "true"、"1"、"YES"、"Y"、"ON" の場合、ブール値は `true` になる。それ以外の場合、値は false として解釈される

source: Boom! Your Quarkus app is now running at <code>localhost:8080</code>
ja_jp: Quarkus アプリは <code>localhost:8080</code> で実行中です。

source: Bootstrap Maven properties
ja_jp: ブートストラップ Maven プロパティー

source: Bootstrap the application
ja_jp: アプリケーションのブートストラップ

source: Bootstrapping Quarkus
ja_jp: Quarkus のブートストラップ

source: Bootstrapping a reactive CRUD application with Quarkus
ja_jp: RESTEasy Reactiveを使ったリアクティブCRUDアプリケーションのブートストラップ

source: Bootstrapping an application
ja_jp: アプリケーション開発の開始

source: Bootstrapping the Reactive Fruits application
ja_jp: リアクティブフルーツアプリケーションの起動

source: Bootstrapping the application
ja_jp: アプリケーションの起動

source: Bootstrapping the project
ja_jp: プロジェクトのブートストラップ

source: Bored with magic tricks?
ja_jp: 手品に飽きた？

source: Both HTTP request and response can be intercepted by providing `ContainerRequestFilter` or `ContainerResponseFilter` implementations respectively. These filters are suitable for processing the metadata associated with a message: HTTP headers, query parameters, media type, and other metadata. They also can abort the request processing, for instance, when the user does not have permission to access the endpoint.
ja_jp: HTTP リクエストとレスポンスの両方とも、それぞれ `ContainerRequestFilter` または `ContainerResponseFilter` の実装を提供することで、インターセプトすることができます。 これらのフィルターは、メッセージに関連付けられたメタデータ (HTTP ヘッダー、クエリパラメーター、メディアタイプ、その他のメタデータ) を処理するのに適しています。 また、ユーザーがエンドポイントにアクセスする権限を持っていない場合などに、リクエスト処理を中止することもできます。

source: Both HTTP request and response can be intercepted by providing `ContainerRequestFilter` or `ContainerResponseFilter` implementations respectively. These filters are suitable for processing the metadata associated with a message: HTTP headers, query parameters, media type, and other metadata. They also have the capability to abort the request processing, for instance when the user does not have the permissions to access the endpoint.
ja_jp: HTTP リクエストとレスポンスの両方とも、それぞれ `ContainerRequestFilter` または `ContainerResponseFilter` の実装を提供することで、 インターセプトすることができます。これらのフィルタは、メッセージに関連付けられたメタデータを処理するのに適しています。HTTP ヘッダ、クエリパラメーター、メディアタイプ、その他のメタデータです。また、ユーザーがエンドポイントにアクセスする権限を持っていない場合など、リクエスト処理を中止する機能も持っています。

source: Both ID and access tokens are considered encrypted if they contain 5 parts separated by the dot character, indicating that the JWE encryption was used.
ja_jp: JWE 暗号化が使用されていることを示すドット文字で区切られた 5 つのパートが含まれている場合、ID トークンとアクセストークンの両方が暗号化されているとみなされます。

source: Both JVM and native executable versions will work.
ja_jp: JVM版とネイティブ実行可能ファイル版の両方が動作します。

source: Both RESTassured and `@TestHTTPResource` allow you to specify the endpoint class you are testing rather than hard coding a path. This currently supports both JAX-RS endpoints, Servlets and Reactive Routes. This makes it a lot easier to see exactly which endpoints a given test is testing.
ja_jp: RESTassured と `@TestHTTPResource` の両方で、パスをハードコーディングするのではなく、テストするエンドポイントクラスを指定することができます。これは現在、JAX-RS エンドポイント、サーブレット、リアクティブルートの両方をサポートしています。これにより、特定のテストがどのエンドポイントをテストしているかを正確に確認することが非常に簡単になりました。

source: Both RESTassured and `@TestHTTPResource` allow you to specify the endpoint class you are testing rather than hard coding a path. This currently supports both Jakarta REST endpoints, Servlets and Reactive Routes. This makes it a lot easier to see exactly which endpoints a given test is testing.
ja_jp: RESTassuredと `@TestHTTPResource` の両方が、パスをハードコーディングするのではなく、テストするエンドポイントクラスを指定することをサポートしています。現在、Jakarta RESTエンドポイント、Servlet、Reactive Routesの両方をサポートしています。これにより、あるテストがどのエンドポイント をテストしているのかを正確に把握することが非常に容易になります。

source: Both `/forbidden` and `/forbidden/` paths need to be secured in order to secure the `forbidden` endpoint.
ja_jp: `forbidden` エンドポイントを保護するには、 `/forbidden` パスと `/forbidden/` パスの両方を保護する必要があります。

source: Both `findByNameWithPanacheQLQuery()` and `findByNameWithNativeQuery()` methods will return the same result but query written in PanacheQL will use the entity field name: `name`, and native query will use the MongoDB field name: `lastname`.
ja_jp: `findByNameWithPanacheQLQuery()` と `findByNameWithNativeQuery()` はどちらも同じ結果を返しますが、PanacheQL で書かれたクエリはエンティティのフィールド名 `name` を使用し、ネイティブクエリは MongoDB のフィールド名 `lastname` を使用します。

source: Both `quarkus-oidc` `Bearer` and `Authorization Code Flow` Authentication mechanisms use <<smallrye-jwt, SmallRye JWT>> to represent JWT tokens as Microprofile JWT `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: `quarkus-oidc` の `Bearer` と `Authorization Code Flow` 認証メカニズムはいずれも link:#smallrye-jwt[SmallRye JWT ]を使用して、JWT トークンを Microprofile JWT `org.eclipse.microprofile.jwt.JsonWebToken` として表現しています。
